meeting/minutes/2026/04-14.org
:PROPERTIES:
:ID:       85258162-48F4-4379-A049-2EB9638FAA97
:END:
#+title: QT4 CG Meeting 160 Minutes 2026-04-14
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6 toc:nil
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+html_head: <link rel="shortcut icon" href="/img/QT4-64.png" />
#+html_head: <link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

[[../][Meeting index]] / [[https://qt4cg.org][QT4CG.org]] / [[https://qt4cg.org/dashboard][Dashboard]] / [[https://github.com/qt4cg/qtspecs/issues][GH Issues]] / [[https://github.com/qt4cg/qtspecs/pulls][GH Pull Requests]]

#+TOC: headlines 6

* Summary of new and continuing actions [0/8]
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: new-actions
:END:

+ [ ] QT4CG-143-02: MK to try to recover the ability to extract formal equivalences into tests
+ [ ] QT4CG-144-01: MK to consider if any now lost value comparisons should be added as examples.
+ [ ] QT4CG-150-04: NW to see about a status update on PR #2345; possibly schedule discussion
+ [ ] QT4CG-156-01: MK: add reference to data model in F&O 9.2
+ [ ] QT4CG-156-03: MK to revise PR #2516 in light of the comments. 
+ [ ] QT4CG-158-01: MK to revisit the Conformance section to revise in light of #2556 error changes
+ [ ] QT4CG-158-02: MK to add ~system-properties()~ keys for file and binary support
+ [ ] QT4CG-160-01: MK to fix the markup error in method/method call in #2578
+ [ ] QT4CG-160-02: NW to think about how to promote the dated drafts for broader community feedback.

* Minutes
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: minutes
:END:

Approved [[../2026/04-21.html][at meeting 161]] on 21 April 2026.

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call [8/10]
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

Regrets: JWL, AP

+ [X] David J Birnbaum (DB)
+ [X] Reece Dunn (RD)
+ [X] Christian Grün (CG)
+ [X] Joel Kalvesmaki (JK)
+ [X] Michael Kay (MK)
+ [X] Juri Leino (JLO)
+ [ ] John Lumley (JWL)
+ [ ] Alan Painter (AP)
+ [X] Wendell Piez (WP)
+ [X] Norm Tovey-Walsh (NW) /Scribe/. /Chair/.

** Accept the agenda
:PROPERTIES:
:CUSTOM_ID: agenda
:END:

Proposal: Accept [[../../agenda/2026/04-14.html][the agenda]].

+ MK: I’ve been away on vacation and focusing on running tests so a little slow
  on PRs.

** Approve minutes of the previous meeting
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:END:

Proposal: Accept [[../../minutes/2026/04-07.html][the minutes of the previous meeting]].

Accepted.

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:END:

The next meeting is planned for 21 April 2026.

JWL gives regrets. RD may be a bit late.

** Review of open action items [0/7]
:PROPERTIES:
:CUSTOM_ID: open-actions
:END:

+ [ ] QT4CG-143-02: MK to try to recover the ability to extract formal equivalences into tests
+ [ ] QT4CG-144-01: MK to consider if any now lost value comparisons should be added as examples.
+ [ ] QT4CG-150-04: NW to see about a status update on PR #2345; possibly schedule discussion
+ [ ] QT4CG-156-01: MK: add reference to data model in F&O 9.2
+ [ ] QT4CG-156-03: MK to revise PR #2516 in light of the comments. 
+ [ ] QT4CG-158-01: MK to revisit the Conformance section to revise in light of #2556 error changes
+ [ ] QT4CG-158-02: MK to add ~system-properties()~ keys for file and binary support

** Review of open pull requests and issues
:PROPERTIES:
:CUSTOM_ID: open-pull-requests
:END:

This section summarizes all of the issues and pull requests that need to be
resolved before we can finish. See [[#technical-agenda][Technical Agenda]] below for the focus of this
meeting.

*** Blocked
:PROPERTIES:
:CUSTOM_ID: blocked
:END:

The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.

+ PR [[https://qt4cg.org/dashboard/#pr-2470][#2470]]: 1310 Functions fn:regex and ?matching-substrings
+ PR [[https://qt4cg.org/dashboard/#pr-2350][#2350]]: 708 An alternative proposal for generators
+ PR [[https://qt4cg.org/dashboard/#pr-2345][#2345]]: 2299 Expand pipeline to allow arrow expression in path expression
+ PR [[https://qt4cg.org/dashboard/#pr-2247][#2247]]: 716 Deferred Evaluation in XPath - the f:generator record
+ PR [[https://qt4cg.org/dashboard/#pr-2160][#2160]]: 2073 data model changes for JNodes and Sequences
+ PR [[https://qt4cg.org/dashboard/#pr-2071][#2071]]: 77c deep update
+ PR [[https://qt4cg.org/dashboard/#pr-2019][#2019]]: 1776: XSLT template rules for maps and array

*** Close without action
:PROPERTIES:
:CUSTOM_ID: close-without-action
:END:

It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/1584][#1584]]: Review the XML Schema and RELAX NG schemas for XSLT 4.0 for compatibility

Proposal: close with no further action.

Accepted.

*** Substantive PRs
:PROPERTIES:
:CUSTOM_ID: substantive
:END:

The following substantive PRs were open when this agenda was prepared.

+ PR [[https://qt4cg.org/dashboard/#pr-2578][#2578]]: 2561 Explain and define methods and method calls
+ PR [[https://qt4cg.org/dashboard/#pr-2577][#2577]]: 2575 Make xs:error available unconditionally
+ PR [[https://qt4cg.org/dashboard/#pr-2574][#2574]]: 2550 Shadow attributes in RELAX NG grammar (alt)
+ PR [[https://qt4cg.org/dashboard/#pr-2566][#2566]]: 1979 Records with type annotations

* Technical agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

** PR #2578: 2561 Explain and define methods and method calls
:PROPERTIES:
:CUSTOM_ID: pr-2578
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2578][#2578]].

+ MK: This is editorial; CG pointed out that the discussion was a bit light.
  + … The section called “Method Calls” is expanded to “Methods and Method Calls”
  + … It adds definitions and gives a bit more explanation of the example

ACTION QT4CG-160-01: MK to fix the markup error in method/method call in #2578

+ MK: A few other editorial improvements.

Proposal: accept this PR.

Accepted. 

** PR #2577: 2575 Make xs:error available unconditionally
:PROPERTIES:
:CUSTOM_ID: pr-2577
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2577][#2577]].

+ MK: The diff is poor. It should have had master merged into it. Let’s look at
  the issue first.
  + … The spec currently says that the ~xs:error~ constructor function is
    available if you support XSD 1.1.
  + … The thrust of this PR is to make ~xs:error~ available whether or not you
    support XSD 1.1 aligning with our other decisions.
+ RD: In one of the specs, we define some extensions like ~xs:yearDateDuration~.
+ MK: Yes, that’s all been tidied up previously.
+ MK: If we look at the actual commit…
  + … We say there’s a constructor function irrespective of whether or not you
    support XSD 1.1.
+ JLO: We need this. Thank you!

Proposal: accept this PR.

Accepted. 

** PR #2574: 2550 Shadow attributes in RELAX NG grammar (alt)
:PROPERTIES:
:CUSTOM_ID: pr-2574
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2574][#2574]].

+ NW attempts to summarize the changes
+ WP: Thank you.

Proposal: accept this PR.

Accepted. 

** PR #2566: 1979 Records with type annotations
:PROPERTIES:
:CUSTOM_ID: pr-2566
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2566][#2566]].

Are we ready for more discussion?

+ MK: There’s nothing new to discuss this week.

** Triage and issue review
:PROPERTIES:
:CUSTOM_ID: triage
:END:

It seems unlikely that the reviewing PRs will take the full hour. Let’s plan to
consider other triage activities.

+ JLO: The collection function with two arguments is missing.

Some discussion; JLO agrees to take a stab at writing a proposal.

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:

Another dated draft?

+ MK: I think every three months is good; but some feedback would be nice.

+ NW: How about we see if we can bed the record types with annotations.

ACTION QT4CG-160-02: NW to think about how to promote the dated drafts for broader community feedback.

Some discussion of the W3C process for publishing the final recommendations.

Next time to chat about this is at the W3C Tech Plenary in Dublin this fall.

