meeting/minutes/2026/04-14.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 160 Minutes 2026-04-14</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 160 Minutes 2026-04-14</h1>
<p>
<a href="../">Meeting index</a> / <a href="https://qt4cg.org">QT4CG.org</a> / <a href="https://qt4cg.org/dashboard">Dashboard</a> / <a href="https://github.com/qt4cg/qtspecs/issues">GH Issues</a> / <a href="https://github.com/qt4cg/qtspecs/pulls">GH Pull Requests</a>
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#new-actions">Summary of new and continuing actions <code>[0/8]</code></a></li>
<li><a href="#minutes">Draft Minutes</a></li>
<li><a href="#administrivia">1. Administrivia</a>
<ul>
<li><a href="#roll-call">1.1. Roll call <code>[8/10]</code></a></li>
<li><a href="#agenda">1.2. Accept the agenda</a></li>
<li><a href="#approve-minutes">1.3. Approve minutes of the previous meeting</a></li>
<li><a href="#next-meeting">1.4. Next meeting</a></li>
<li><a href="#open-actions">1.5. Review of open action items <code>[0/7]</code></a></li>
<li><a href="#open-pull-requests">1.6. Review of open pull requests and issues</a>
<ul>
<li><a href="#blocked">1.6.1. Blocked</a></li>
<li><a href="#close-without-action">1.6.2. Close without action</a></li>
<li><a href="#substantive">1.6.3. Substantive PRs</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#technical-agenda">2. Technical agenda</a>
<ul>
<li><a href="#pr-2578">2.1. PR #2578: 2561 Explain and define methods and method calls</a></li>
<li><a href="#pr-2577">2.2. PR #2577: 2575 Make xs:error available unconditionally</a></li>
<li><a href="#pr-2574">2.3. PR #2574: 2550 Shadow attributes in RELAX NG grammar (alt)</a></li>
<li><a href="#pr-2566">2.4. PR #2566: 1979 Records with type annotations</a></li>
<li><a href="#triage">2.5. Triage and issue review</a></li>
</ul>
</li>
<li><a href="#any-other-business">3. Any other business</a></li>
</ul>
</div>
</div>
<div id="outline-container-new-actions" class="outline-2">
<h2 id="new-actions">Summary of new and continuing actions <code>[0/8]</code></h2>
<div class="outline-text-2" id="text-new-actions">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-143-02: MK to try to recover the ability to extract formal equivalences into tests</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-144-01: MK to consider if any now lost value comparisons should be added as examples.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-150-04: NW to see about a status update on PR #2345; possibly schedule discussion</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-156-01: MK: add reference to data model in F&amp;O 9.2</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-156-03: MK to revise PR #2516 in light of the comments.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-158-01: MK to revisit the Conformance section to revise in light of #2556 error changes</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-158-02: MK to add <code>system-properties()</code> keys for file and binary support</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-160-01: MK to fix the markup error in method/method call in #2578</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-160-02: NW to think about how to promote the dated drafts for broader community feedback.</li>
</ul>
</div>
</div>
<div id="outline-container-minutes" class="outline-2">
<h2 id="minutes">Draft Minutes</h2>
<div class="outline-text-2" id="text-minutes">
</div>
</div>
<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>
<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call <code>[8/10]</code></h3>
<div class="outline-text-3" id="text-roll-call">
<p>
Regrets: JWL, AP
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> David J Birnbaum (DB)</li>
<li class="on"><code>[X]</code> Reece Dunn (RD)</li>
<li class="on"><code>[X]</code> Christian Grün (CG)</li>
<li class="on"><code>[X]</code> Joel Kalvesmaki (JK)</li>
<li class="on"><code>[X]</code> Michael Kay (MK)</li>
<li class="on"><code>[X]</code> Juri Leino (JLO)</li>
<li class="off"><code>[&#xa0;]</code> John Lumley (JWL)</li>
<li class="off"><code>[&#xa0;]</code> Alan Painter (AP)</li>
<li class="on"><code>[X]</code> Wendell Piez (WP)</li>
<li class="on"><code>[X]</code> Norm Tovey-Walsh (NW) <i>Scribe</i>. <i>Chair</i>.</li>
</ul>
</div>
</div>
<div id="outline-container-agenda" class="outline-3">
<h3 id="agenda"><span class="section-number-3">1.2.</span> Accept the agenda</h3>
<div class="outline-text-3" id="text-agenda">
<p>
Proposal: Accept <a href="../../agenda/2026/04-14.html">the agenda</a>.
</p>

<ul class="org-ul">
<li>MK: I’ve been away on vacation and focusing on running tests so a little slow
on PRs.</li>
</ul>
</div>
</div>
<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.3.</span> Approve minutes of the previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Proposal: Accept <a href="../../minutes/2026/04-07.html">the minutes of the previous meeting</a>.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
The next meeting is planned for 21 April 2026.
</p>

<p>
JWL gives regrets. RD may be a bit late.
</p>
</div>
</div>
<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[0/7]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-143-02: MK to try to recover the ability to extract formal equivalences into tests</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-144-01: MK to consider if any now lost value comparisons should be added as examples.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-150-04: NW to see about a status update on PR #2345; possibly schedule discussion</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-156-01: MK: add reference to data model in F&amp;O 9.2</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-156-03: MK to revise PR #2516 in light of the comments.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-158-01: MK to revisit the Conformance section to revise in light of #2556 error changes</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-158-02: MK to add <code>system-properties()</code> keys for file and binary support</li>
</ul>
</div>
</div>
<div id="outline-container-open-pull-requests" class="outline-3">
<h3 id="open-pull-requests"><span class="section-number-3">1.6.</span> Review of open pull requests and issues</h3>
<div class="outline-text-3" id="text-open-pull-requests">
<p>
This section summarizes all of the issues and pull requests that need to be
resolved before we can finish. See <a href="#technical-agenda">Technical Agenda</a> below for the focus of this
meeting.
</p>
</div>
<div id="outline-container-blocked" class="outline-4">
<h4 id="blocked"><span class="section-number-4">1.6.1.</span> Blocked</h4>
<div class="outline-text-4" id="text-blocked">
<p>
The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2470">#2470</a>: 1310 Functions fn:regex and ?matching-substrings</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2350">#2350</a>: 708 An alternative proposal for generators</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2345">#2345</a>: 2299 Expand pipeline to allow arrow expression in path expression</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2247">#2247</a>: 716 Deferred Evaluation in XPath - the f:generator record</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2160">#2160</a>: 2073 data model changes for JNodes and Sequences</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2071">#2071</a>: 77c deep update</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2019">#2019</a>: 1776: XSLT template rules for maps and array</li>
</ul>
</div>
</div>
<div id="outline-container-close-without-action" class="outline-4">
<h4 id="close-without-action"><span class="section-number-4">1.6.2.</span> Close without action</h4>
<div class="outline-text-4" id="text-close-without-action">
<p>
It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1584">#1584</a>: Review the XML Schema and RELAX NG schemas for XSLT 4.0 for compatibility</li>
</ul>

<p>
Proposal: close with no further action.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-substantive" class="outline-4">
<h4 id="substantive"><span class="section-number-4">1.6.3.</span> Substantive PRs</h4>
<div class="outline-text-4" id="text-substantive">
<p>
The following substantive PRs were open when this agenda was prepared.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2578">#2578</a>: 2561 Explain and define methods and method calls</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2577">#2577</a>: 2575 Make xs:error available unconditionally</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2574">#2574</a>: 2550 Shadow attributes in RELAX NG grammar (alt)</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2566">#2566</a>: 1979 Records with type annotations</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
</div>
<div id="outline-container-pr-2578" class="outline-3">
<h3 id="pr-2578"><span class="section-number-3">2.1.</span> PR #2578: 2561 Explain and define methods and method calls</h3>
<div class="outline-text-3" id="text-pr-2578">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2578">#2578</a>.
</p>

<ul class="org-ul">
<li>MK: This is editorial; CG pointed out that the discussion was a bit light.
<ul class="org-ul">
<li>… The section called “Method Calls” is expanded to “Methods and Method Calls”</li>
<li>… It adds definitions and gives a bit more explanation of the example</li>
</ul></li>
</ul>

<p>
ACTION QT4CG-160-01: MK to fix the markup error in method/method call in #2578
</p>

<ul class="org-ul">
<li>MK: A few other editorial improvements.</li>
</ul>

<p>
Proposal: accept this PR.
</p>

<p>
Accepted. 
</p>
</div>
</div>
<div id="outline-container-pr-2577" class="outline-3">
<h3 id="pr-2577"><span class="section-number-3">2.2.</span> PR #2577: 2575 Make xs:error available unconditionally</h3>
<div class="outline-text-3" id="text-pr-2577">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2577">#2577</a>.
</p>

<ul class="org-ul">
<li>MK: The diff is poor. It should have had master merged into it. Let’s look at
the issue first.
<ul class="org-ul">
<li>… The spec currently says that the <code>xs:error</code> constructor function is
available if you support XSD 1.1.</li>
<li>… The thrust of this PR is to make <code>xs:error</code> available whether or not you
support XSD 1.1 aligning with our other decisions.</li>
</ul></li>
<li>RD: In one of the specs, we define some extensions like <code>xs:yearDateDuration</code>.</li>
<li>MK: Yes, that’s all been tidied up previously.</li>
<li>MK: If we look at the actual commit…
<ul class="org-ul">
<li>… We say there’s a constructor function irrespective of whether or not you
support XSD 1.1.</li>
</ul></li>
<li>JLO: We need this. Thank you!</li>
</ul>

<p>
Proposal: accept this PR.
</p>

<p>
Accepted. 
</p>
</div>
</div>
<div id="outline-container-pr-2574" class="outline-3">
<h3 id="pr-2574"><span class="section-number-3">2.3.</span> PR #2574: 2550 Shadow attributes in RELAX NG grammar (alt)</h3>
<div class="outline-text-3" id="text-pr-2574">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2574">#2574</a>.
</p>

<ul class="org-ul">
<li>NW attempts to summarize the changes</li>
<li>WP: Thank you.</li>
</ul>

<p>
Proposal: accept this PR.
</p>

<p>
Accepted. 
</p>
</div>
</div>
<div id="outline-container-pr-2566" class="outline-3">
<h3 id="pr-2566"><span class="section-number-3">2.4.</span> PR #2566: 1979 Records with type annotations</h3>
<div class="outline-text-3" id="text-pr-2566">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2566">#2566</a>.
</p>

<p>
Are we ready for more discussion?
</p>

<ul class="org-ul">
<li>MK: There’s nothing new to discuss this week.</li>
</ul>
</div>
</div>
<div id="outline-container-triage" class="outline-3">
<h3 id="triage"><span class="section-number-3">2.5.</span> Triage and issue review</h3>
<div class="outline-text-3" id="text-triage">
<p>
It seems unlikely that the reviewing PRs will take the full hour. Let’s plan to
consider other triage activities.
</p>

<ul class="org-ul">
<li>JLO: The collection function with two arguments is missing.</li>
</ul>

<p>
Some discussion; JLO agrees to take a stab at writing a proposal.
</p>
</div>
</div>
</div>
<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
<p>
Another dated draft?
</p>

<ul class="org-ul">
<li>MK: I think every three months is good; but some feedback would be nice.</li>

<li>NW: How about we see if we can bed the record types with annotations.</li>
</ul>

<p>
ACTION QT4CG-160-02: NW to think about how to promote the dated drafts for broader community feedback.
</p>

<p>
Some discussion of the W3C process for publishing the final recommendations.
</p>

<p>
Next time to chat about this is at the W3C Tech Plenary in Dublin this fall.
</p>
</div>
</div>
</div>
</body>
</html>
